ProyectoBalanceadorDeCarga/BalanceoApacheMod/artillery/load-test_hard.yml
config:
  target: "http://192.168.50.3"  # IP del nodo manager
  phases:
    - duration: 30
      arrivalRate: 10   # 30 usuarios por segundo durante 60 segundos
      rampTo: 40 
      name: Warm up
    - duration: 60
      arrivalRate: 40   # 40 a 120 usuarios por segundo durante 60 segundos
      rampTo: 120
      name: Ramp up to peak load
    - duration: 120
      arrivalRate: 120   # 120 usuarios por segundo durante 90 segundos
      rampTo: 150
      name: Peak load

scenarios:
  - flow:
      - get:
          url: "/"